# /, // და % ოპერატორების განსხვავება

# 1. ჩვეულებრივი გაყოფა (/)
# ეს ოპერატორი იყენება რიცხვების გასაყოფად და ყოველთვის აბრუნებს ათწილადს (float)
print(10 / 3)   # შედეგი : 3.33333333(უსასრულოდ)
print(20 / 4)   # შედეგი : 5.0

# 2. მთელ რიცხვზე გაყოფა (//)
# გაყოფს რიცხვებს, მაგრამ აბრუნებს მხოლოდ მთელ ნაწილს
print(10 // 3)  # შედეგი: 3 (რამდენჯერ თავსდება გამყოფი გასაყოფში)
print(20 // 4)  # შედეგი: 5

# 3. ნაშთიანი გაყოფა (%)
# აბრუნებს გაყოფის ნაშთს
print(10 % 3)  # შედეგი: 1 (ნაშთი 1 დარჩა)
print(20 % 4)  # შედეგი: 0 (რადგან ზუსტად იყოფა ნაშთი 0 დარჩა)

# მარტივი ახსნა:
# / -> ჩვეულებრივი გაყოფა (უბრალოდ ყოფს)
# // -> მთელ რიცხვზე გაყოფა (მხოლოდ მთელ ნაწილს ტოვებს)
# % -> ნაშთიანი გაყოფა (რამდენი დარჩება გაყოფის შემდეგ)

