# ფუნქცია არის მრავალჯერ გამოყენბადი კოდის ბლოკი

# ფუნქციები რაც აქამდე ვისწავლეთ:
# print(5, "Luka") # () - ბრჩხილებს შორის ჩაწერილ ინფორმაციას ჰქვია არგუმეტნი. ფუნქციას შეუძლია მიიღოს რამდენიმე არგუმენტი და ისინი უნდა გამოვყოთ ერთმანეთისგან მძიმეებით (,)
# type(False)
# int()
# str()
# float()
# input()
# range()


# სახელი() - რომელიც ასრულებს კონკრეტულ დავალებას და მხოლოდ ვიყენებთ არის ფუნქცია
# 

# ფუნქციების შეიძლება არგუმენტად გადავცეთ მათემატიკური, შედარების, ლოგიკური და კონკატინაციის ოპერაცია. პირველ რიგში გამოითვლება ამ ოპერაციის შედეგი და შემდეგ დაიწყებს ფუნქცია მუშაობას