# მომხმარებლის ინფორმაციის შეკითხვა და ცვლადებში შენახვა
name = input("შეიყვანეთ თქვენი სახელი: ")
surname = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")
location = input("შეიყვანეთ თქვენი ადგილმდებარეობა: ")
occupation = input("შეიყვანეთ თქვენი პროფესიები: ")
hobby = input("შეიყვანეთ თქვენი ჰობი: ")

# შეტანილი მონაცემების გამოტანა
print("სახელი:", name)
print("გვარი:", surname)
print("ასაკი:", age)
print("ადგილმდებარეობა:", location)
print("პროფესია:", occupation)
print("ჰობი:", hobby)
