# 1) მოხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი დაუბეჭდეთ ეს რიცხვი დადებითია, უარყოფითი თუ ნეიტურალი ანუ ნული.
#  შემდეგ კომენტარებით ახსენით რა გასნხვავებაა if-სა და elif-ს შორის რატომ არ შეიძლება ზოგერ elif-ს ნაცვლად if-ის გამოყენება

number = int(input("შეიყვანე რიცხვი: "))  # მომხმარებელს შემოატანინეთ რიცხვი და გადავიყვანოთ მთელ რიცხვად

if number > 0:                             # თუ რიცხვი მეტია 0-ზე
    print("რიცხვი პოზიტიურია")           # გამოიტანე რომ პოზიტიურია
elif number == 0:                          # თუ რიცხვი ტოლია 0-ის
    print("რიცხვი ნეიტრალურია")          # გამოიტანე რომ ნეიტრალურია
else:                                      # სხვა ყველა შემთხვევაში (ანუ უარყოფითია)
    print("რიცხვი ნეგატიურია")           # გამოიტანე რომ ნეგატიურია



# if გამოიყენება ახალი პირობის შესამოწმებლად.
# elif კი მხოლოდ მაშინ მოწმდება, თუ წინა if იყო False.
